src_ext/InformationRegisters/УЗ_НастройкиПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_НастройкиПочты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
					<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Включена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/CommonModules/УЗ_Почта/Ext/Module.bsl
//Отправка писем ученикам и родителям средствами платформы (ИнтернетПочта),
//без подсистем хозяина. Настройки SMTP — регистр УЗ_НастройкиПочты, одна запись
//с идентификатором "ОСНОВНАЯ"; пароль читается только в привилегированном режиме.

Функция ИдентификаторНастроек() Экспорт
	Возврат "ОСНОВНАЯ";
КонецФункции

//Настройки почты без пароля — для формы и проверок.
//Структура: Включена, СерверSMTP, Порт, ИспользоватьSSL, Логин, АдресОтправителя,
//ИмяОтправителя, ПарольЗадан.
Функция Настройки() Экспорт

	Результат = Новый Структура("Включена, СерверSMTP, Порт, ИспользоватьSSL, Логин,
		|АдресОтправителя, ИмяОтправителя, ПарольЗадан",
		Ложь, "", 0, Ложь, "", "", "", Ложь);

	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.УЗ_НастройкиПочты.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = ИдентификаторНастроек();
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Запись, , "ПарольЗадан");
		Результат.ПарольЗадан = Не ПустаяСтрока(Запись.Пароль);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;

КонецФункции

//Готова ли почта к отправке; Причина — что не заполнено.
Функция ПочтаНастроена(Причина = "") Экспорт

	Параметры = Настройки();
	Если Не Параметры.Включена Тогда
		Причина = НСтр("ru = 'Отправка писем выключена в настройках почты.'");
	ИначеЕсли ПустаяСтрока(Параметры.СерверSMTP) Тогда
		Причина = НСтр("ru = 'Не указан сервер SMTP.'");
	ИначеЕсли ПустаяСтрока(Параметры.АдресОтправителя) Тогда
		Причина = НСтр("ru = 'Не указан адрес отправителя.'");
	Иначе
		Причина = "";
	КонецЕсли;
	Возврат ПустаяСтрока(Причина);

КонецФункции

//Отправить письмо. Возвращает Истина или Ложь; ТекстОшибки — почему не ушло.
//  Адреса — строка "a@b.ru; c@d.ru" или массив строк.
Функция Отправить(Адреса, Тема, Текст, ТекстОшибки = "") Экспорт

	Если Не ПочтаНастроена(ТекстОшибки) Тогда
		Возврат Ложь;
	КонецЕсли;

	СписокАдресов = ?(ТипЗнч(Адреса) = Тип("Массив"), Адреса,
		СтрРазделить(СтрЗаменить(Адреса, ",", ";"), ";", Ложь));
	Получатели = Новый Массив;
	Для Каждого Адрес Из СписокАдресов Цикл
		Адрес = СокрЛП(Адрес);
		Если СтрНайти(Адрес, "@") > 1 Тогда
			Получатели.Добавить(Адрес);
		КонецЕсли;
	КонецЦикла;
	Если Получатели.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Нет ни одного корректного адреса получателя.'");
		Возврат Ложь;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.УЗ_НастройкиПочты.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = ИдентификаторНастроек();
	Запись.Прочитать();
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = Запись.СерверSMTP;
	Профиль.ПортSMTP = ?(Запись.Порт = 0, ?(Запись.ИспользоватьSSL, 465, 25), Запись.Порт);
	Профиль.ИспользоватьSSLSMTP = Запись.ИспользоватьSSL;
	Если Не ПустаяСтрока(Запись.Логин) Тогда
		Профиль.ПользовательSMTP = Запись.Логин;
		Профиль.ПарольSMTP = Запись.Пароль;
	КонецЕсли;
	Профиль.Таймаут = 30;
	АдресОтправителя = Запись.АдресОтправителя;
	ИмяОтправителя = Запись.ИмяОтправителя;
	УстановитьПривилегированныйРежим(Ложь);

	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Отправитель = АдресОтправителя;
	Письмо.ИмяОтправителя = ИмяОтправителя;
	Письмо.Тема = Тема;
	Для Каждого Адрес Из Получатели Цикл
		Письмо.Получатели.Добавить(Адрес);
	КонецЦикла;
	Письмо.Тексты.Добавить(Текст, ТипТекстаПочтовогоСообщения.ПростойТекст);

	Почта = Новый ИнтернетПочта;
	//в профиле задан только SMTP: входящая почта не нужна, подключение идёт к серверу отправки
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьОшибку(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;

	Попытка
		Почта.Послать(Письмо);
		Почта.Отключиться();
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьОшибку(ТекстОшибки);
		Попытка
			Почта.Отключиться();
		Исключение
			ЗаписатьОшибку(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;

КонецФункции

Процедура ЗаписатьОшибку(ТекстОшибки)

	ЗаписьЖурналаРегистрации(НСтр("ru = 'Учёт занятий.Почта'"),
		УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);

КонецПроцедуры
